Revit 2027 API
DWGExportOptions(DWGExportOptions) Constructor
 Constructs a new instance of DWGExportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWGExportOptions(
	DWGExportOptions option
)
Public Sub New (
	option As DWGExportOptions
)
public:
DWGExportOptions(
	DWGExportOptions^ option
)
new :
        option : DWGExportOptions -> DWGExportOptions
Parameters
option DWGExportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWGExportOptions Class
DWGExportOptions Overload
Autodesk.Revit.DB Namespace